package main

import "fmt"

//Необходимо создать карту с ключами: «слон», «бегемот», «носорог», «лев»;
//В качестве значений нужно использовать пустые структуры.
//Далее удалить бегемота и результат вывести в консоль

func main() {

	map1 := map[string]string{}

	map1["слон"] = ""
	map1["бегемот"] = ""
	map1["носорог"] = ""
	map1["лев"] = ""

	fmt.Println("В Кении можно встретить таких животных, как: ", map1)
	delete(map1, "бегемот")
	fmt.Println("В Ботсване можно встретить таких животных, как: ", map1)
}
