package main

import "fmt"

// Необходимо создать карту с ключами: «слон», «бегемот», «носорог», «лев»;
// В качестве значений нужно использовать пустые структуры.
// Далее добавить «выдра» и результат вывести в консоль.
func main() {

	map1 := map[string]string{}

	map1["слон"] = ""
	map1["бегемот"] = ""
	map1["носорог"] = ""
	map1["лев"] = ""

	fmt.Println("В Кении можно встретить таких животных, как: ", map1)
	map1["выдра"] = ""
	fmt.Println("В лесах Сызрани можно встретить таких животных, как: ", map1)

}
